hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.h
    @param[in] name  Name of the subcommand set.
*/
#define NRF_CLI_CREATE_STATIC_SUBCMD_SET(name)                  \
    /*lint -save -e85 -e31*/                                    \
    static nrf_cli_static_entry_t const CONCAT_2(name, _raw)[]; \
    static nrf_cli_cmd_entry_t const name = {                   \
                                                                .is_dynamic = false,                                    \
                                                                .u.p_static = CONCAT_2(name, _raw)                      \
                                            };                                                          \
    static nrf_cli_static_entry_t const CONCAT_2(name, _raw)[] = /*lint -restore*/

/**
    @brief Define ending subcommands set.

*/
#define NRF_CLI_SUBCMD_SET_END {NULL}

/**
    @brief Macro for creating a dynamic entry.

    @param[in] name  Name of the dynamic entry.
    @param[in] p_get Pointer to the function returning dynamic commands array @ref nrf_cli_dynamic_get.
*/
#define NRF_CLI_CREATE_DYNAMIC_CMD(name, p_get) \
    /*lint -save -e19*/                         \
    static nrf_cli_cmd_entry_t const name = {   \
                                                .is_dynamic  = true,                    \
                                                .u.p_dynamic_get = p_get                \
                                            }; /*lint -restore*/

/**
    @brief Initializes a CLI command (@ref nrf_cli_static_entry).

    @param[in] _p_syntax  Command syntax (for example: history).
    @param[in] _p_subcmd  Pointer to a subcommands array.
    @param[in] _p_help    Pointer to a command help string.
    @param[in] _p_handler Pointer to a function handler.
*/
#define NRF_CLI_CMD(_p_syntax, _p_subcmd, _p_help, _p_handler) { \
        .p_syntax = (const char *)  STRINGIFY(_p_syntax), \
                    .p_subcmd =                 _p_subcmd,  \
                                                .p_help  = (const char *)   _p_help,    \
                                                           .handler =                  _p_handler  \
    }

/**
    @internal @brief Internal CLI state in response to data received from the terminal.
*/
typedef enum
{
    NRF_CLI_RECEIVE_DEFAULT,
    NRF_CLI_RECEIVE_ESC,
    NRF_CLI_RECEIVE_ESC_SEQ,
    NRF_CLI_RECEIVE_TILDE_EXP
} nrf_cli_receive_t;


/**
    @internal @brief Internal CLI state.
*/
typedef enum
{
    NRF_CLI_STATE_UNINITIALIZED,      //!< State uninitialized.
    NRF_CLI_STATE_INITIALIZED,        //!< State initialized but not active.
    NRF_CLI_STATE_ACTIVE,             //!< State active.
    NRF_CLI_STATE_PANIC_MODE_ACTIVE,  //!< State panic mode activated.
    NRF_CLI_STATE_PANIC_MODE_INACTIVE //!< State panic mode requested but not supported.
} nrf_cli_state_t;

/**
    @brief Event type from CLI transport.
*/
typedef enum
{
    NRF_CLI_TRANSPORT_EVT_RX_RDY,
    NRF_CLI_TRANSPORT_EVT_TX_RDY
} nrf_cli_transport_evt_t;

typedef void (*nrf_cli_transport_handler_t)(nrf_cli_transport_evt_t evt_type, void *p_context);

typedef struct nrf_cli_transport_s nrf_cli_transport_t;

/**
    @brief Unified CLI transport interface.
*/
typedef struct
{
    /**
        @brief Function for initializing the CLI transport interface.
    
        @param[in] p_transport   Pointer to the transfer instance.
        @param[in] p_config      Pointer to instance configuration.
        @param[in] evt_handler   Event handler.
        @param[in] p_context     Pointer to the context passed to event handler.
    
        @return Standard error code.
    */
    ret_code_t (*init)(nrf_cli_transport_t const *p_transport,
                       void const                 *p_config,
                       nrf_cli_transport_handler_t evt_handler,
                       void                       *p_context);
                       
    /**
        @brief Function for uninitializing the CLI transport interface.
    
        @param[in] p_transport  Pointer to the transfer instance.
    
        @return Standard error code.
    */
    ret_code_t (*uninit)(nrf_cli_transport_t const *p_transport);
    
    /**
        @brief Function for reconfiguring the transport to work in blocking mode.
    
        @param p_transport  Pointer to the transfer instance.
        @param blocking     If true, the transport is enabled in blocking mode.
    
        @return NRF_SUCCESS on successful enabling, error otherwise (also if not supported).
    */
    ret_code_t (*enable)(nrf_cli_transport_t const *p_transport,
                         bool                        blocking);
                         
    /**
        @brief Function for writing data to the transport interface.
    
        @param[in] p_transport  Pointer to the transfer instance.
        @param[in] p_data       Pointer to the source buffer.
        @param[in] length       Source buffer length.
        @param[in] p_cnt        Pointer to the sent bytes counter.
    
        @return Standard error code.
    */
    ret_code_t (*write)(nrf_cli_transport_t const *p_transport,
                        const void                 *p_data,
                        size_t                      length,
                        size_t                     *p_cnt);
                        
    /**
        @brief Function for reading data from the transport interface.
    
        @param[in] p_transport  Pointer to the transfer instance.
        @param[in] p_data       Pointer to the destination buffer.
        @param[in] length       Destination buffer length.
        @param[in] p_cnt        Pointer to the received bytes counter.
    
        @return Standard error code.
    */
    ret_code_t (*read)(nrf_cli_transport_t const *p_transport,
                       void                       *p_data,
                       size_t                      length,
                       size_t                     *p_cnt);
                       
} nrf_cli_transport_api_t;

struct nrf_cli_transport_s
{
    nrf_cli_transport_api_t const *p_api;
};

#if NRF_MODULE_ENABLED(NRF_CLI_HISTORY)
/**
    @brief CLI history object header.
*/
typedef PACKED_STRUCT
{
    nrf_memobj_t *p_prev;   //!< Pointer to the next object.
    nrf_memobj_t *p_next;   //!< Pointer to the previous object.
    nrf_cli_cmd_len_t cmd_len; //!< Command length.
} nrf_cli_memobj_header_t;
#endif

