hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.h
#if NRF_MODULE_ENABLED(NRF_CLI_STATISTICS)
typedef struct
{
    uint32_t log_lost_cnt;  //!< Lost log counter.
} nrf_cli_statistics_t;
#endif

/**
    @internal @brief Flags for internal CLI usage.
*/
typedef struct
{
    uint32_t insert_mode    : 1; //!< Enables or disables console insert mode for text introduction.
    uint32_t show_help      : 1; //!< Shows help if the command was called with -h or --help parameter.
    uint32_t use_colors     : 1; //!< Enables or disables colored syntax.
    uint32_t echo           : 1; //!< Enables or disables CLI echo.
    uint32_t processing     : 1; //!< CLI is executing process function.
    uint32_t tx_rdy         : 1;
} nrf_cli_flag_t;
STATIC_ASSERT(sizeof(nrf_cli_flag_t) == sizeof(uint32_t));

/**
    @internal @brief Union for internal CLI usage.
*/
typedef union
{
    uint32_t value;
    nrf_cli_flag_t flag;
} nrf_cli_internal_t;

/**
    @brief CLI instance context.
*/
typedef struct
{
    nrf_cli_state_t   state;            //!< Internal module state.
    nrf_cli_receive_t receive_state;    //!< Escape sequence indicator.
    
    nrf_cli_static_entry_t const *p_current_stcmd;  //!< Currently executed command.
    
    nrf_cli_vt100_ctx_t vt100_ctx;          //!< VT100 color and cursor position, terminal width.
    
    nrf_cli_cmd_len_t cmd_buff_len;         //!< Command length.
    nrf_cli_cmd_len_t cmd_buff_pos;         //!< Command buffer cursor position.
    
    #if NRF_MODULE_ENABLED(NRF_CLI_WILDCARD)
    nrf_cli_cmd_len_t cmd_tmp_buff_len;     //!< Command length in tmp buffer
    #endif
    
    char cmd_buff[NRF_CLI_CMD_BUFF_SIZE];       //!< Command input buffer.
    char temp_buff[NRF_CLI_CMD_BUFF_SIZE];      //!< Temporary buffer used by various functions.
    char printf_buff[NRF_CLI_PRINTF_BUFF_SIZE]; //!< Printf buffer size.
    
    #if NRF_MODULE_ENABLED(NRF_CLI_STATISTICS)
    nrf_cli_statistics_t statistics;            //!< CLI statistics.
    #endif
    
    #if NRF_MODULE_ENABLED(NRF_CLI_USES_TASK_MANAGER)
    task_id_t     task_id;
    #endif
    
    #if NRF_MODULE_ENABLED(NRF_CLI_HISTORY)
    nrf_memobj_t *p_cmd_list_head;      //!< Pointer to the head of history list.
    nrf_memobj_t *p_cmd_list_tail;      //!< Pointer to the tail of history list.
    nrf_memobj_t *p_cmd_list_element;   //!< Pointer to an element of history list.
    #endif
    volatile nrf_cli_internal_t internal;   //!< Internal CLI data
} nrf_cli_ctx_t;

extern const nrf_log_backend_api_t nrf_log_backend_cli_api;

typedef struct
{
    nrf_queue_t const *p_queue;
    void               *p_context;
    nrf_cli_t const    *p_cli;
} nrf_cli_log_backend_t;

#if NRF_CLI_LOG_BACKEND && NRF_MODULE_ENABLED(NRF_LOG)
#define NRF_LOG_BACKEND_CLI_DEF(_name_, _queue_size_)                                          \
    NRF_QUEUE_DEF(nrf_log_entry_t,                                                         \
                  CONCAT_2(_name_, _queue),_queue_size_, NRF_QUEUE_MODE_NO_OVERFLOW);      \
    static nrf_cli_log_backend_t CONCAT_2(cli_log_backend,_name_) = {                      \
                                                                                           .p_queue = &CONCAT_2(_name_, _queue),                                          \
                                                                    };                                                                                     \
    NRF_LOG_BACKEND_DEF(_name_, nrf_log_backend_cli_api, &CONCAT_2(cli_log_backend,_name_))

#define NRF_CLI_BACKEND_PTR(_name_) &CONCAT_2(_name_, _log_backend)
#else
#define NRF_LOG_BACKEND_CLI_DEF(_name_, _queue_sz_)
#define NRF_CLI_BACKEND_PTR(_name_) NULL
#endif

#if NRF_MODULE_ENABLED(NRF_CLI_HISTORY)
/* Header consists memory for cmd length and pointer to: prev and next element. */
#define NRF_CLI_HISTORY_HEADER_SIZE (sizeof(nrf_cli_memobj_header_t))

#define NRF_CLI_HISTORY_MEM_OBJ(name)                       \
    NRF_MEMOBJ_POOL_DEF(CONCAT_2(name, _cmd_hist_memobj),   \
                        NRF_CLI_HISTORY_HEADER_SIZE +           \
                        NRF_CLI_HISTORY_ELEMENT_SIZE,           \
                        NRF_CLI_HISTORY_ELEMENT_COUNT)

#define NRF_CLI_MEMOBJ_PTR(_name_) &CONCAT_2(_name_, _cmd_hist_memobj)
#else
#define NRF_CLI_MEMOBJ_PTR(_name_) NULL
#define NRF_CLI_HISTORY_MEM_OBJ(name)
#endif

/**
    @brief CLI instance internals.

    @ref nrf_cli_t
*/
struct nrf_cli
{
    char const *const p_name;  //!< Terminal name.
    
    nrf_cli_transport_t const *p_iface;         //!< Transport interface.
    nrf_cli_ctx_t              *p_ctx;          //!< Internal context.
    nrf_log_backend_t const    *p_log_backend;  //!< Logger backend.
    nrf_fprintf_ctx_t          *p_fprintf_ctx;  //!< fprintf context.
    nrf_memobj_pool_t const    *p_cmd_hist_mempool; //!< Memory reserved for commands history.
    char const newline_char;   //!< New line character, only allowed values: \\n and \\r.
};

/**
    @brief Macro for defining a command line interface instance.

    @param[in] name              Instance name.
    @param[in] cli_prefix        CLI prefix string.
    @param[in] p_transport_iface Pointer to the transport interface.
    @param[in] newline_ch        New line character - only allowed values are '\\n' or '\\r'.
    @param[in] log_queue_size    Logger processing queue size.
*/
#define NRF_CLI_DEF(name, cli_prefix, p_transport_iface, newline_ch, log_queue_size)    \
    static nrf_cli_t const name;                                            \
    static nrf_cli_ctx_t CONCAT_2(name, _ctx);                              \
    NRF_FPRINTF_DEF(CONCAT_2(name, _fprintf_ctx),                           \
                    &name,                                                  \
                    CONCAT_2(name, _ctx).printf_buff,                       \
                    NRF_CLI_PRINTF_BUFF_SIZE,                               \
                    false,                                                  \
                    nrf_cli_print_stream);                                  \
    NRF_LOG_BACKEND_CLI_DEF(CONCAT_2(name, _log_backend), log_queue_size);  \
    NRF_CLI_HISTORY_MEM_OBJ(name);                                          \
    /*lint -save -e31*/                                                     \
    static nrf_cli_t const name = {                                         \
                                                                            .p_name = cli_prefix,                                               \
                                                                            .p_iface = p_transport_iface,                                       \
                                                                            .p_ctx = &CONCAT_2(name, _ctx),                                     \
                                                                            .p_log_backend = NRF_CLI_BACKEND_PTR(name),                         \
                                                                            .p_fprintf_ctx = &CONCAT_2(name, _fprintf_ctx),                     \
                                                                            .p_cmd_hist_mempool = NRF_CLI_MEMOBJ_PTR(name),                     \
                                                                            .newline_char = newline_ch                                          \
                                  } /*lint -restore*/

/**
    @brief Function for initializing a transport layer and internal CLI state.

