hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/libraries/cli/nrf_cli.h
    @param[in] p_cli                 Pointer to CLI instance.
    @param[in] p_transport_config    Configuration forwarded to the transport during initialization.
    @param[in] use_colors            Enables colored prints.
    @param[in] log_backend           If true, the console will be used as logger backend.
    @param[in] init_lvl              Default severity level for the logger.

    @return Standard error code.
*/
ret_code_t nrf_cli_init(nrf_cli_t const    *p_cli,
                        void const         *p_transport_config,
                        bool                use_colors,
                        bool                log_backend,
                        nrf_log_severity_t  init_lvl);
                        
ret_code_t nrf_cli_task_create(nrf_cli_t const *p_cli);

/**
    @brief Function for uninitializing a transport layer and internal CLI state.
          If function returns NRF_ERROR_BUSY, you must call @ref nrf_cli_process before calling
          nrf_cli_uninit again.

    @param p_cli Pointer to CLI instance.

    @return Standard error code.
*/
ret_code_t nrf_cli_uninit(nrf_cli_t const *p_cli);

/**
    @brief Function for starting CLI processing.

    @param p_cli Pointer to the CLI instance.

    @return Standard error code.
*/
ret_code_t nrf_cli_start(nrf_cli_t const *p_cli);

/**
    @brief Function for stopping CLI processing.

    @param p_cli Pointer to CLI instance.

    @return Standard error code.
*/
ret_code_t nrf_cli_stop(nrf_cli_t const *p_cli);

/**
    @brief CLI colors for @ref nrf_cli_fprintf function.
*/
#define NRF_CLI_DEFAULT  NRF_CLI_VT100_COLOR_DEFAULT    /**< Turn off character attributes. */
#define NRF_CLI_NORMAL   NRF_CLI_VT100_COLOR_WHITE      /**< Normal color printf.           */
#define NRF_CLI_INFO     NRF_CLI_VT100_COLOR_GREEN      /**< Info color printf.             */
#define NRF_CLI_OPTION   NRF_CLI_VT100_COLOR_CYAN       /**< Option color printf.           */
#define NRF_CLI_WARNING  NRF_CLI_VT100_COLOR_YELLOW     /**< Warning color printf.          */
#define NRF_CLI_ERROR    NRF_CLI_VT100_COLOR_RED        /**< Error color printf.            */

/**
    @brief   Printf-like function which sends formatted data stream to the CLI.
            This function shall not be used outside of the CLI module or CLI command context.

    @param[in] p_cli Pointer to the CLI instance.
    @param[in] color Printf color.
    @param[in] p_fmt Format string.
    @param[in] ...   List of parameters to print.
*/
void nrf_cli_fprintf(nrf_cli_t const       *p_cli,
                     nrf_cli_vt100_color_t  color,
                     char const            *p_fmt,
                     ...);
                     
/**
    @brief Process function, which should be executed when data is ready in the transport interface.

    @param[in] p_cli Pointer to the CLI instance.
*/
void nrf_cli_process(nrf_cli_t const *p_cli);


/**
    @brief Option descriptor.
*/
typedef struct nrf_cli_getopt_option
{
    char const *p_optname;          //!< Option long name.
    char const *p_optname_short;    //!< Option short name.
    char const *p_optname_help;     //!< Option help string.
} nrf_cli_getopt_option_t;


/**
    @brief Option structure initializer @ref nrf_cli_getopt_option.

    @param[in] _p_optname    Option name long.
    @param[in] _p_shortname  Option name short.
    @param[in] _p_help       Option help string.
*/
#define NRF_CLI_OPT(_p_optname, _p_shortname, _p_help) { \
        .p_optname       = _p_optname,   \
                           .p_optname_short = _p_shortname, \
                                              .p_optname_help  = _p_help,      \
    }

/**
    @brief Informs that a command has been called with -h or --help option.

    @param[in] p_cli Pointer to the CLI instance.

    @return          True if help has been requested.
*/
__STATIC_INLINE bool nrf_cli_help_requested(nrf_cli_t const *p_cli);

#ifndef SUPPRESS_INLINE_IMPLEMENTATION
__STATIC_INLINE bool nrf_cli_help_requested(nrf_cli_t const *p_cli)
{
    return p_cli->p_ctx->internal.flag.show_help;
}
#endif

/**
    @brief       Prints the current command help.
    @details     Function will print a help string with: the currently entered command, its options,
                and subcommands (if they exist).

    @param[in] p_cli     Pointer to the CLI instance.
    @param[in] p_opt     Pointer to the optional option array.
    @param[in] opt_len   Option array size.
*/
void nrf_cli_help_print(nrf_cli_t const                *p_cli,
                        nrf_cli_getopt_option_t const *p_opt,
                        size_t                          opt_len);
                        
/**
    @internal @brief This function shall not be used directly, it is required by the
                    nrf_fprintf module.

    @param[in] p_user_ctx    Pointer to the context for the CLI instance.
    @param[in] p_data        Pointer to the data buffer.
    @param[in] data_len      Data buffer size.
*/
void nrf_cli_print_stream(void const *p_user_ctx, char const *p_data, size_t data_len);

/** @} */

#ifdef __cplusplus
}
#endif

#endif /* NRF_CLI_H__ */
